gongbox/msp430f5529-library/System/inc/msp430f5529_MemMap.h
#ifndef MEMMAP_H_
#define MEMMAP_H_

#include "common.h"
#include "msp430f5529_gpio.h"

typedef struct ADC_MemMap
{
    union
    {
        uint16_t CTL0;
        struct
        {
            uint16_t SC         :1; /* ADC12 Start Conversion */
            uint16_t ENC        :1; /* ADC12 Enable Conversion */
            uint16_t TOVIE      :1; /* ADC12 Timer Overflow interrupt enable */
            uint16_t OVIE       :1; /* ADC12 Overflow interrupt enable */
            uint16_t ON         :1; /* ADC12 On/enable */
            uint16_t ADCREFON   :1; /* ADC12 Reference on */
            uint16_t REF2_5V    :1; /* ADC12 Ref 0:1.5V / 1:2.5V */
            uint16_t MSC        :1; /* ADC12 Multiple SampleConversion */
            uint16_t SHT0       :4; /* ADC12 Sample Hold 0 Select  */
            uint16_t SHT1       :4; /* ADC12 Sample Hold 1 Select  */
        };
    };
    union
    {
        uint16_t CTL1;
        struct
        {
            uint16_t ADBUSY     :1; /* ADC12 Busy */
            uint16_t CONSEQ     :2; /* ADC12 Conversion Sequence Select  */
            uint16_t SSEL       :2; /* ADC12 Clock Source Select  */
            uint16_t DIV        :3; /* ADC12 Clock Divider Select  */
            uint16_t ISSH       :1; /* ADC12 Invert Sample Hold Signal */
            uint16_t SHP        :1; /* ADC12 Sample/Hold Pulse Mode */
            uint16_t SHS        :2; /* ADC12 Sample/Hold Source  */
            uint16_t CSTARTADD  :4; /* ADC12 Conversion Start Address  */
        };
    };
    union
    {
        uint16_t CTL2;
        struct
        {
            uint16_t REFBURST   :1; /* ADC12+ Reference Burst */
            uint16_t ADCREFOUT  :1; /* ADC12+ Reference Out */
            uint16_t SR         :1; /* ADC12+ Sampling Rate */
            uint16_t DF         :1; /* ADC12+ Data Format */
            uint16_t RES        :2; /* ADC12+ Resolution  */
            uint16_t TCOFF      :1; /* ADC12+ Temperature Sensor Off */
            uint16_t PDIV       :1; /* ADC12+ predivider 0:/1   1:/4 */
        };
    };
    uint16_t RESERVED_1[2];
    uint16_t IFG;
    uint16_t IE;
    uint16_t IV;
    struct
    {
        uint8_t INCH    :4; /* ADC12 Input Channel Select*/
        uint8_t REF     :3; /* ADC12 Select Reference  */
        uint8_t EOS     :1; /* ADC12 End of Sequence */
    } MCTL[16];
    uint16_t MEM[16];
}volatile *ADC_MemMapPtr;

#define ADC12_SSEL_ADC12OSC       0
#define ADC12_SSEL_ACLK           1                   
#define ADC12_SSEL_MCLK           2
#define ADC12_SSEL_SMCLK          3   

#define ADC12_SREF_0            0
#define ADC12_SREF_1            1 
#define ADC12_SREF_2            2
#define ADC12_SREF_3            3
#define ADC12_SREF_4            4
#define ADC12_SREF_5            5
#define ADC12_SREF_6            6
#define ADC12_SREF_7            7

#define ADC_BASE_PTR                     ((ADC_MemMapPtr)__MSP430_BASEADDRESS_ADC12_PLUS__)

typedef struct UCS_MemMap
{
    union
    {
        uint16_t CTL0;
        struct
        {
            uint8_t     :3;
            uint8_t MOD :5;
            uint8_t DCO :5;
        };
    };
    union
    {
        uint16_t CTL1;
        struct
        {
            uint8_t DisMOD  :1;
            uint8_t         :3;
            uint8_t DCORSEL :3;
        };
    };
    union
    {
        uint16_t CTL2;
        struct
        {
            uint16_t FLLN   :10;
            uint16_t        :2;
            uint16_t FLLD   :3;
        };
    };
    union
    {
        uint16_t CTL3;
        struct
        {
            uint8_t FLLREFDIV   :3;
            uint8_t             :1;
            uint8_t SELREF      :3;
        };
    };
    union
    {
        uint16_t CTL4;
        struct
        {
            uint8_t SELM    :3;
            uint8_t         :1;
            uint8_t SELS    :3;
            uint8_t         :1;
            uint8_t SELA    :3;
            uint8_t         :1;
        };
    };
    union
    {
        uint16_t CTL5;
        struct
        {
            uint8_t DIVM    :3;
            uint8_t         :1;
            uint8_t DIVS    :3;
            uint8_t         :1;
            uint8_t DIVA    :3;
            uint8_t         :1;
            uint8_t DIVPA   :3;
            uint8_t         :1;
        };
    };
    union
    {
        uint16_t CTL6;
        struct
        {
            uint8_t XT1_OFF     :1; /* High Frequency Oscillator 1 (XT1) disable */
            uint8_t SMCLK_OFF   :1; /* SMCLK Off */
            uint8_t XCAP        :2; /* XIN/XOUT*/
            uint8_t XT1_BYPASS  :1; /* XT1 bypass mode : 0: internal 1:sourced from external pin */
            uint8_t XT_S        :1; /* 1: Selects high-freq. oscillator */
            uint8_t XT1DRIVE    :2; /* XT1 Drive Level mode */
            uint8_t XT2_OFF     :1; /* High Frequency Oscillator 2 (XT2) disable */
            uint8_t             :3;
            uint8_t XT2_BYPASS  :1; /* XT2 bypass mode : 0: internal 1:sourced from external pin */
            uint8_t             :1;
            uint8_t XT2DRIVE    :2; /* XT2 Drive Level mode  */
        };
    };
    union
    {
        uint16_t CTL7;
        struct
        {
            uint8_t DCO_FFG     :1; /* DCO Fault Flag */
            uint8_t XT1_LFOFFG  :1; /* XT1 Low Frequency Oscillator Fault Flag */
            uint8_t             :1;
            uint8_t XT2_OFFG    :1; /* High Frequency Oscillator 2 Fault Flag */
        };
    };
    union
    {
        uint16_t CTL8;
        struct
        {
            uint8_t ACLK_REQEN      :1; /* ACLK Clock Request Enable */
            uint8_t MCLK_REQEN      :1; /* MCLK Clock Request Enable */
            uint8_t SMCLK_REQEN     :1; /* SMCLK Clock Request Enable */
            uint8_t MODOSC_REQEN    :1; /* MODOSC Clock Request Enable */
        };
    };
}volatile *UCS_MemMapPtr;

#define UCS_BASE_PTR                                  ((UCS_MemMapPtr)__MSP430_BASEADDRESS_UCS__)

extern const UCS_MemMapPtr UCS;

typedef struct COMPB_MemMap
{
    union
    {
        uint16_t CTL0;
        struct
        {
            uint16_t IPSEL  :4; /* Comp. B Pos. Channel Input Select 3 */
            uint16_t        :3;
            uint16_t IPEN   :1; /* Comp. B Pos. Channel Input Enable */
            uint16_t IMSEL  :4; /* Comp. B Neg. Channel Input Select 3 */
            uint16_t        :3;
            uint16_t IMEN   :1; /* Comp. B Neg. Channel Input Enable */
        };
    };
    union
    {
        uint16_t CTL1;
        struct
        {
            uint16_t CB_OUT     :1; /* Comp. B Output */
            uint16_t OUTPOL     :1; /* Comp. B Output Polarity */
            uint16_t F          :1; /* Comp. B Enable Output Filter */
            uint16_t IES        :1; /* Comp. B Interrupt Edge Select */
            uint16_t SHORT      :1; /* Comp. B Input Short */
            uint16_t EX         :1; /* Comp. B Exchange Inputs */
            uint16_t FDLY       :2; /* Comp. B Filter delay  */
            uint16_t PWRMD      :2; /* Comp. B Power Mode */
            uint16_t ON         :1; /* Comp. B enable */
            uint16_t MRVL       :1; /* Comp. B MRV Level */
            uint16_t MRVS       :1; /* Comp. B Output selects between VREF0 or VREF1*/
            uint16_t            :3;
        };
    };
    union
    {
        uint16_t CTL2;
        struct
        {
            uint16_t REF0   :5; /* Comp. B Reference 0 Resistor Select Bit : 4 */
            uint16_t RSEL   :1; /* Comp. B Reference select */
            uint16_t RS     :2; /* Comp. B Reference Source Bit : 1 */
            uint16_t REF1   :5; /* Comp. B Reference 1 Resistor Select Bit : 4 */
            uint16_t REFL   :2; /* Comp. B Reference voltage level Bit : 1 */
            uint16_t REFACC :1; /* Comp. B Reference Accuracy */
        };
    };
    union
    {
        uint16_t CTL3;
        struct
        {
            uint16_t PD0    :1; /* Comp. B Disable Input Buffer of Port Register .0 */
            uint16_t PD1    :1; /* Comp. B Disable Input Buffer of Port Register .1 */
            uint16_t PD2    :1; /* Comp. B Disable Input Buffer of Port Register .2 */
            uint16_t PD3    :1; /* Comp. B Disable Input Buffer of Port Register .3 */
            uint16_t PD4    :1; /* Comp. B Disable Input Buffer of Port Register .4 */
            uint16_t PD5    :1; /* Comp. B Disable Input Buffer of Port Register .5 */
            uint16_t PD6    :1; /* Comp. B Disable Input Buffer of Port Register .6 */
            uint16_t PD7    :1; /* Comp. B Disable Input Buffer of Port Register .7 */
            uint16_t PD8    :1; /* Comp. B Disable Input Buffer of Port Register .8 */
            uint16_t PD9    :1; /* Comp. B Disable Input Buffer of Port Register .9 */
            uint16_t PD10   :1; /* Comp. B Disable Input Buffer of Port Register .10 */
            uint16_t PD11   :1; /* Comp. B Disable Input Buffer of Port Register .11 */
            uint16_t PD12   :1; /* Comp. B Disable Input Buffer of Port Register .12 */
            uint16_t PD13   :1; /* Comp. B Disable Input Buffer of Port Register .13 */
            uint16_t PD14   :1; /* Comp. B Disable Input Buffer of Port Register .14 */
            uint16_t PD15   :1; /* Comp. B Disable Input Buffer of Port Register .15 */
        };
    };
    uint16_t RESERVED[2];
    union
    {
        uint16_t INT;
        struct
        {
            union
            {
                uint8_t CB_IFG;
                struct
                {
                    uint8_t IFG     :1; /* Comp. B Interrupt Flag */
                    uint8_t IIFG    :1; /* Comp. B Interrupt Flag Inverted Polarity */
                    uint8_t         :6;
                };
            };
            union
            {
                uint8_t CB_IE;
                struct
                {
                    uint8_t IE  :1; /* Comp. B Interrupt Enable */
                    uint8_t IIE :1; /* Comp. B Interrupt Enable Inverted Polarity */
                    uint8_t     :6;
                };
            };
        };
    };
    union
    {
        uint16_t IV;
        struct
        {
            uint16_t IV_NONE    :1; /* No Interrupt pending */
            uint16_t IV_IFG     :1; /* IFG */
            uint16_t IV_IIFG    :1; /* IIFG */
        };
    };
}volatile *COMPB_MemMapPtr;

#define COMPB_BASE_PTR                  ((COMPB_MemMapPtr)__MSP430_BASEADDRESS_COMPB__)

/** GPIO - Peripheral register structure */
#include "msp430f5529_gpio.h"
typedef struct GPIO_MemMap
{
#ifdef GPIO_PORT_SIZE_WORD
  uint16_t IN; 
  uint16_t POUT;                  
  uint16_t PDIR;                   
  uint16_t REN;                      
  uint16_t DS;                      
  uint16_t SEL;                     
  uint8_t RESERVED_0[2];
  uint16_t :16;                  
  uint8_t RESERVED_1[8];
  uint16_t IES;                      
  uint16_t IE;                       
  uint16_t IFG;                     
  uint16_t :16;
#else
    uint8_t IN;
    uint8_t :8;  //无名成员，占用8bit，只用来作填充或调整位置，
    uint8_t POUT;
    uint8_t :8;
    uint8_t PDIR;
    uint8_t :8;
    uint8_t REN;
    uint8_t :8;
    uint8_t DS;
    uint8_t :8;
    uint8_t SEL;
    uint8_t :8;
    uint8_t RESERVED_0[2];
    uint16_t :16;
    uint8_t RESERVED_1[8];
    uint8_t IES;
    uint8_t :8;
    uint8_t IE;
    uint8_t :8;
    uint8_t IFG;
    uint8_t :8;
    uint16_t :16;
#endif
}volatile *GPIO_MemMapPtr;
