gongbox/msp430f5529-library/System/inc/msp430f5529_MemMap.h
/* GPIO - Peripheral instance base addresses */
#define PA_BASE_PTR                             ((GPIO_MemMapPtr)&PAIN)
#define PB_BASE_PTR                             ((GPIO_MemMapPtr)&PBIN)
#define PC_BASE_PTR                             ((GPIO_MemMapPtr)&PCIN)
#define PD_BASE_PTR                             ((GPIO_MemMapPtr)&PDIN)

#define P1_BASE_PTR                             ((GPIO_MemMapPtr)&P1IN)
#define P2_BASE_PTR                             ((GPIO_MemMapPtr)&P2IN)
#define P3_BASE_PTR                             ((GPIO_MemMapPtr)&P3IN)
#define P4_BASE_PTR                             ((GPIO_MemMapPtr)&P4IN)
#define P5_BASE_PTR                             ((GPIO_MemMapPtr)&P5IN)
#define P6_BASE_PTR                             ((GPIO_MemMapPtr)&P6IN)
#define P7_BASE_PTR                             ((GPIO_MemMapPtr)&P7IN)
#define P8_BASE_PTR                             ((GPIO_MemMapPtr)&P8IN)

typedef struct DMA_MemMap
{
    uint8_t TSSEL[8];
    union
    {
        uint16_t CTL4;
        struct
        {
            uint16_t DMA_ENNMI      :1; /* Enable NMI interruption of DMA */
            uint16_t DMA_ROUNDROBIN :1; /* Round-Robin DMA channel priorities */
            uint16_t RMWDIS         :1; /* Inhibited DMA transfers during read-modify-write CPU operations */
        };
    };
    uint16_t RESERVED[2];
    uint16_t IV;
    struct
    {
        union
        {
            uint16_t CTL;
            struct
            {
                uint16_t REQ        :1; /* Initiate DMA transfer with DMATSEL */
                uint16_t ABORT      :1; /* DMA transfer aborted by NMI */
                uint16_t IE         :1; /* DMA interrupt enable */
                uint16_t IFG        :1; /* DMA interrupt flag */
                uint16_t EN         :1; /* DMA enable */
                uint16_t LEVEL      :1; /* DMA level sensitive trigger select */
                uint16_t SRCBYTE    :1; /* DMA source byte */
                uint16_t DSTBYTE    :1; /* DMA destination byte */
                uint16_t SRCINCR    :2; /* DMA source increment bit 1 */
                uint16_t DSTINCR    :2; /* DMA destination increment bit 1 */
                uint16_t DT         :3; /* DMA transfer mode bit 2 */
            };
        };
        uint32_t SA;
        uint32_t DA;
        uint16_t SZ;
        uint16_t RESERVED[2];
    } CHX[3];
}volatile *DMA_MemMapPtr;

#define DMA_BASE_PTR                           ((DMA_MemMapPtr)__MSP430_BASEADDRESS_DMAX_3__)

typedef struct TIMER_MemMap
{
    union
    {
        uint16_t CTL;
        struct
        {
            uint16_t IFG    :1; /* Timer A counter interrupt flag */
            uint16_t IE     :1; /* Timer A counter interrupt enable */
            uint16_t CLR    :1; /* Timer A counter clear */
            uint16_t        :1;
            uint16_t MC     :2; /* Timer A mode control 1 */
            uint16_t ID     :2; /* Timer A clock input divider 1 */
            uint16_t SSEL   :2; /* Timer A clock source select 1 */
        };
    };
    union
    {
        uint16_t CTL;
        struct
        {
            uint16_t IFG        :1; /* Capture/compare interrupt flag */
            uint16_t CH_COV     :1; /* Capture/compare overflow flag */
            uint16_t CH_OUT     :1; /* PWM Output signal if output mode 0 */
            uint16_t CH_CCI     :1; /* Capture input signal (read) */
            uint16_t IE         :1; /* Capture/compare interrupt enable */
            uint16_t OUTMOD     :3; /* Output mode  */
            uint16_t CAPMODE    :1; /* Capture mode: 1 /Compare mode : 0 */
            //TB
            //uint16_t CLLD                :2;
            //TA
            uint16_t            :1;
            uint16_t CH_SCCI    :1; /* Latched capture signal (read) */
            uint16_t CH_SCS     :1; /* Capture sychronize */
            uint16_t CCIS       :2; /* Capture input select */
            uint16_t CM         :2; /* Capture mode  */
        };
    } CCTL[7];
    uint16_t R;
    uint16_t CCR[7];
    uint16_t EX;
    uint16_t RESERVED[3];
    uint16_t IV;
}volatile *TIMER_MemMapPtr;

#define TIMER_MC_STOP                 (0)  /* Timer A mode control: 0 - Stop */
#define TIMER_MC_UP                   (1)  /* Timer A mode control: 1 - Up to CCR0 */
#define TIMER_MC_CONTINUOUS           (2)  /* Timer A mode control: 2 - Continuous up */
#define TIMER_MC_CONTINOUS            (2)  /* Legacy define */
#define TIMER_MC_UPDOWN               (3)  /* Timer A mode control: 3 - Up/Down */

#define TIMER_SSEL_TACLK              (0) /* Timer A clock source select: 0 - TACLK */
#define TIMER_SSEL_ACLK               (1) /* Timer A clock source select: 1 - ACLK  */
#define TIMER_SSEL_SMCLK              (2) /* Timer A clock source select: 2 - SMCLK */
#define TIMER_SSEL_INCLK              (3) /* Timer A clock source select: 3 - INCLK */

#define TIMER_CCIS_0                  (0) /* Capture input select: 0 - CCIxA */
#define TIMER_CCIS_1                  (1) /* Capture input select: 1 - CCIxB */
#define TIMER_CCIS_2                  (2) /* Capture input select: 2 - GND */
#define TIMER_CCIS_3                  (3) /* Capture input select: 3 - Vcc */

#define TIMER_A0_BASE_PTR                            ((TIMER_MemMapPtr)__MSP430_BASEADDRESS_T0A5__)
#define TIMER_A1_BASE_PTR                            ((TIMER_MemMapPtr)__MSP430_BASEADDRESS_T1A3__)
#define TIMER_A2_BASE_PTR                            ((TIMER_MemMapPtr)__MSP430_BASEADDRESS_T2A3__)
#define TIMER_B0_BASE_PTR                            ((TIMER_MemMapPtr)__MSP430_BASEADDRESS_T0B7__)

extern const TIMER_MemMapPtr TIMERX[];

typedef struct RTC_MemMap
{
    union
    {
        uint16_t CTL01;
        struct
        {
            uint8_t CTL0;
            uint8_t CTL1;
        };
        struct
        {
            uint16_t IFG    :3;
            /*
             uint16_t RDYIFG           :1;     // RTC Ready Interrupt Flag
             uint16_t AIFG             :1;     // RTC Alarm Interrupt Flag
             uint16_t TEVIFG           :1;     // RTC Time Event Interrupt Flag
             */
            uint16_t        :1;
            uint16_t IE     :3;
            /*
             uint16_t RDYIE            :1;     // RTC Ready Interrupt Enable Flag
             uint16_t AIE              :1;     // RTC Alarm Interrupt Enable Flag
             uint16_t TEVIE            :1;     // RTC Time Event Interrupt Enable Flag
             */
            uint16_t        :1;
            uint16_t TEV0   :1; /* RTC Time Event 0 */
            uint16_t TEV1   :1; /* RTC Time Event 1 */
            uint16_t SSEL   :2; /* RTC Source Select */
            uint16_t RDY    :1; /* RTC Ready */
            uint16_t MODE   :1; /* RTC Mode 0:Counter / 1: Calendar */
            uint16_t HOLD   :1; /* RTC Hold */
            uint16_t BCD    :1; /* RTC BCD  0:Binary / 1:BCD */
        };
    };
    union
    {
        uint16_t CTL23;
        struct
        {
            uint8_t CTL2;
            uint8_t CTL3;
        };
        struct
        {
            uint16_t CAL    :6; /* RTC Calibration */
            uint16_t        :1;
            uint16_t CALS   :1; /* RTC Calibration Sign */
            uint16_t CALF   :2; /* RTC Calibration Frequency */
        };
    };
    uint16_t RESERVED_1[2];
    union
    {
        uint16_t PS0CTL;
        struct
        {
            uint16_t RT0_PSIFG  :1; /* RTC Prescale Timer 0 Interrupt Flag */
            uint16_t RT0_PSIE   :1; /* RTC Prescale Timer 0 Interrupt Enable Flag */
            uint16_t RT0_IP     :3; /* RTC Prescale Timer 0 Interrupt Interval */
            uint16_t            :3;
            uint16_t RT0_PSHOLD :1; /* RTC Prescale Timer 0 Hold */
            uint16_t            :2;
            uint16_t RT0_PSDIV  :3; /* RTC Prescale Timer 0 Clock Divide  */
            uint16_t RT0_SSEL   :1; /* RTC Prescale Timer 0 Source Select 0:ACLK / 1:SMCLK */
            uint16_t            :1;
        };
    };
    union
    {
        uint16_t PS1CTL;
        struct
        {
            uint16_t RT1_PSIFG  :1; /* RTC Prescale Timer 1 Interrupt Flag */
            uint16_t RT1_PSIE   :1; /* RTC Prescale Timer 1 Interrupt Enable Flag */
            uint16_t RT1_IP     :3; /* RTC Prescale Timer 1 Interrupt Interval  */
            uint16_t            :3;
            uint16_t RT1_PSHOLD :1; /* RTC Prescale Timer 1 Hold */
            uint16_t            :2;
            uint16_t RT1_PSDIV  :3; /* RTC Prescale Timer 1 Clock Divide  */
            uint16_t RT1_SSEL   :2; /* RTC Prescale Timer 1 Source Select */
        };
    };
    uint16_t PS;
    uint16_t IV;

