gongbox/msp430f5529-library/System/inc/msp430f5529_MemMap.h
    uint16_t TIM0;
    uint16_t TIM1;
    uint16_t DATE;
    uint16_t YEAR;
    uint16_t AMINHR;
    uint16_t DOWDAY;
}volatile *RTC_MemMapPtr;

#define RTC_BASE_PTR                    ((RTC_MemMapPtr)__MSP430_BASEADDRESS_RTC__)
extern const RTC_MemMapPtr RTC;

typedef struct USCI_MemMap
{
    union
    {
        uint16_t CTLW;
        struct
        {
            union
            {
                uint8_t CTL1;
                //UART
                struct
                {
                    uint8_t SWRST   :1; /* USCI Software Reset */
                    uint8_t TXBRK   :1; /* Send next Data as Break */
                    uint8_t TXADDR  :1; /* Send next Data as Address */
                    uint8_t DORM    :1; /* Dormant (Sleep) Mode */
                    uint8_t BRKIE   :1; /* Break interrupt enable */
                    uint8_t RXEIE   :1; /* RX Error interrupt enable */
                    //SSEL公用
                    uint8_t SSEL    :2; /* USCI 0 Clock Source Select */
                };
                //SPI
                /*
                 struct
                 {
                 uint8_t :8;
                 };
                 */
                //I2C
                struct
                {
                    uint8_t         :1;
                    uint8_t TXSTT   :1; /* Transmit START */
                    uint8_t TXSTP   :1; /* Transmit STOP */
                    uint8_t TXNACK  :1; /* Transmit NACK */
                    uint8_t TR      :1; /* Transmit/Receive Select/Flag */
                    uint8_t         :1;
                };
            };
            union
            {
                uint8_t CTL0;
                //UART
                struct
                {
                    uint8_t SYNC    :1; /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */
                    uint8_t MODE    :2; /* Async. Mode: USCI Mode 0 */
                    uint8_t SPB     :1; /* Async. Mode: Stop Bits  0:one / 1: two */
                    uint8_t UC_7BIT :1; /* Async. Mode: Data Bits  0:8-bits / 1:7-bits */
                    uint8_t MSB     :1; /* Async. Mode: MSB first  0:LSB / 1:MSB */
                    uint8_t PAR     :1; /* Async. Mode: Parity     0:odd / 1:even */
                    uint8_t PEN     :1; /* Async. Mode: Parity enable */
                };
                //SPI
                struct
                {
                    uint8_t         :3;
                    uint8_t MST     :1; /* Sync. Mode: Master Select */
                    uint8_t         :2;
                    uint8_t CKMODE  :2;
                    //uint8_t CKPL              :1;    /* Sync. Mode: Clock Polarity */
                    //uint8_t CKPH              :1;    /* Sync. Mode: Clock Phase */        
                };
                //I2C
                struct
                {
                    uint8_t         :5;
                    uint8_t MM      :1; /* Multi-Master Environment */
                    uint8_t SLA10   :1; /* 10-bit Slave Address Mode */
                    uint8_t OA10    :1; /* 10-bit Address Mode */
                };
            };
        };
    };
    uint8_t RESERVED_1[4];
    union
    {
        uint16_t BRW;
        struct
        {
            uint8_t BR0;
            uint8_t BR1;
        };
    };
    union
    {
        uint16_t MCTL;
        struct
        {
            uint8_t OS16    :1; /* USCI 16-times Oversampling enable */
            uint8_t BRS     :3; /* USCI Second Stage Modulation Select */
            uint8_t BRF     :4; /* USCI First Stage Modulation Select*/
        };
    };
    union
    {
        uint16_t STAT;
        //AX
        struct
        {
            uint8_t UC_BUSY     :1; /* USCI Busy Flag */
            uint8_t ADDR        :1; /* USCI Address received Flag */
            uint8_t RXERR       :1; /* USCI RX Error Flag */
            uint8_t BRK         :1; /* USCI Break received */
            uint8_t PE          :1; /* USCI Parity Error Flag */
            uint8_t OE          :1; /* USCI Overrun Error Flag */
            uint8_t FE          :1; /* USCI Frame Error Flag */
            uint8_t LISTEN      :1; /* USCI Listen mode */
        };
        //UCBX
        struct
        {
            uint8_t         :4;
            uint8_t BBUSY   :1; /* Bus Busy Flag */
            uint8_t GC      :1; /* General Call address received Flag */
            uint8_t SCLLOW  :1; /* SCL low */
            uint8_t         :1;
        };
    };

    uint8_t RXBUF;
    uint8_t RESERVED_3;
    uint8_t TXBUF;
    uint8_t RESERVED_4;
    union  //共同占用两个字
    {
        struct
        {
            uint16_t ABCTL;
            union
            {
                uint16_t IRCTL;
                struct
                {
                    union
                    {
                        uint8_t IRTCTL;
                        struct
                        {
                            uint8_t IREN        :1; /* IRDA Encoder/Decoder enable */
                            uint8_t IRTXCLK     :1; /* IRDA Transmit Pulse Clock Select */
                            uint8_t IRTXPL      :6;    // IRDA Transmit Pulse Length
                            /*
                             uint8_t IRTXPL0           :1;    // IRDA Transmit Pulse Length 0 
                             uint8_t IRTXPL1           :1;    // IRDA Transmit Pulse Length 1  
                             uint8_t IRTXPL2           :1;    // IRDA Transmit Pulse Length 2  
                             uint8_t IRTXPL3           :1;    // IRDA Transmit Pulse Length 3   
                             uint8_t IRTXPL4           :1;    // IRDA Transmit Pulse Length 4   
                             uint8_t IRTXPL5           :1;    // IRDA Transmit Pulse Length 5 
                             */
                        };
                    };
                    union
                    {
                        uint8_t IRRCTL;
                        struct
                        {
                            uint8_t IRRXFE :1;    // IRDA Receive Filter enable 
                            uint8_t IRRXPL :1;   // IRDA Receive Input Polarity 
                            uint8_t IRRXFL :6;    // IRDA Receive Filter Length 
                            /*
                             uint8_t IRRXFL0           :1;    // IRDA Receive Filter Length 0 
                             uint8_t IRRXFL1           :1;    // IRDA Receive Filter Length 1 
                             uint8_t IRRXFL2           :1;    // IRDA Receive Filter Length 2 
                             uint8_t IRRXFL3           :1;    // IRDA Receive Filter Length 3 
                             uint8_t IRRXFL4           :1;    // IRDA Receive Filter Length 4 
                             uint8_t IRRXFL5           :1;    // IRDA Receive Filter Length 5 
                             */
                        };
                    };
                };
            };
        }; //USCIA
        struct
        {
            uint16_t I2COA;
            uint16_t I2CSA;
        };
        //USCIB
    };
    uint8_t RESERVED_2[8];
    union
    {
        uint16_t ICTL;
        struct
        {
            union
            {
                uint8_t IE;
                struct
                {
                    uint8_t RXIE    :1; /* USCI Receive Interrupt Enable */
                    uint8_t TXIE    :1; /* USCI Transmit Interrupt Enable */
                    //UCBX
                    uint8_t STTIE   :1; /* START Condition interrupt enable */
                    uint8_t STPIE   :1; /* STOP Condition interrupt enable */
                    uint8_t ALIE    :1; /* Arbitration Lost interrupt enable */
                    uint8_t NACKIE  :1; /* NACK Condition interrupt enable */
                };
            };
            union
            {
                uint8_t IFG;
                struct
                {
                    uint8_t RXIFG   :1; /* USCI Receive Interrupt Flag */
                    uint8_t TXIFG   :1; /* USCI Transmit Interrupt Flag */
                    //BX
                    uint8_t STTIFG  :1; /* START Condition interrupt Flag */
                    uint8_t STPIFG  :1; /* STOP Condition interrupt Flag */
                    uint8_t ALIFG   :1; /* Arbitration Lost interrupt Flag */
                    uint8_t NACKIFG :1; /* NAK Condition interrupt Flag */
                };
            };
        };
    };
    uint16_t IV;
}volatile *USCI_MemMapPtr;

#define USCI_SSEL__UCLK        (0)    /* USCI 0 Clock Source: UCLK */
#define USCI_SSEL__ACLK        (1)    /* USCI 0 Clock Source: ACLK */
#define USCI_SSEL__SMCLK       (2)    /* USCI 0 Clock Source: SMCLK */

#define USCI_A0_BASE_PTR    ((USCI_MemMapPtr)__MSP430_BASEADDRESS_USCI_A0__)
#define USCI_A1_BASE_PTR    ((USCI_MemMapPtr)__MSP430_BASEADDRESS_USCI_A1__)
#define USCI_B0_BASE_PTR    ((USCI_MemMapPtr)__MSP430_BASEADDRESS_USCI_B0__)
#define USCI_B1_BASE_PTR    ((USCI_MemMapPtr)__MSP430_BASEADDRESS_USCI_B1__)

extern const USCI_MemMapPtr USCIX[];

#ifdef __MSP430_HAS_FLASH__
typedef struct FLASH_MemMap
{
    /* FCTL1 Control Bits */
    union
    {
        uint8_t FCTL1;
        struct
        {
            uint8_t         :1; /* Reserved */
            uint8_t FERASE  :1; /* Enable bit for Flash segment erase */
            uint8_t FMERAS  :1; /* Enable bit for Flash mass erase */
            uint8_t         :2; /* Reserved */
            uint8_t FSWRT   :1; /* Smart Write enable */
            uint8_t FWRT    :1; /* Enable bit for Flash write */
            uint8_t FBLKWRT :1; /* Enable bit for Flash segment write */
        };
    };
    union
    {
        uint8_t FCTL3;
        struct
        {
            uint8_t FBUSY       :1; /* Flash busy: 1 */
            uint8_t FKEYV       :1; /* Flash Key violation flag */
            uint8_t FACCVIFG    :1; /* Flash Access violation flag */
            uint8_t FWAIT       :1; /* Wait flag for segment write */
            uint8_t FLOCK       :1; /* Lock bit: 1 - Flash is locked (read only) */
            uint8_t FEMEX       :1; /* Flash Emergency Exit */
            uint8_t FLOCKA      :1; /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
        };
    };
    union
    {
        uint8_t FCTL4;
        struct
        {
            uint8_t FVPE        :1; /* Voltage Changed during Program Error Flag */
            uint8_t             :3;
            uint8_t FMGR0       :1; /* Marginal read 0 mode. */
            uint8_t FMGR1       :1; /* Marginal read 1 mode. */
            uint8_t             :1;
            uint8_t FLOCKINFO   :1; /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */
        };
    };
}volatile *FLASH_MemMapPtr;

