gongbox/msp430f5529-library/System/inc/msp430f5529_MemMap.h
#define FLASH_BASE_PTR          ((FLASH_MemMapPtr)__MSP430_BASEADDRESS_FLASH__)
#endif

#ifdef __MSP430_HAS_WDT_A__
typedef struct WDT_MemMap
{
    uint8_t RESERVED[11];
    union
    {
        uint16_t CTL;
        struct
        {
            uint16_t IS     :3; /* WDT - Timer Interval Select */
            uint16_t CNTCL  :1; /* WDT - Timer Clear */
            uint16_t TMSEL  :1; /* WDT - Timer Mode Select */
            uint16_t SSEL   :2; /* WDT - Timer Clock Source Select  */
            uint16_t HOLD   :1; /* WDT - Timer hold */
            uint16_t PW     :8;
        };
    };
}volatile *WDT_MemMapPtr;

#define WDT_PASSWARD            (0x5Au)
#define WDT_SSEL_SMCLK          (0)  /* WDT - Timer Clock Source Select: SMCLK */
#define WDT_SSEL_ACLK           (1)  /* WDT - Timer Clock Source Select: ACLK */
#define WDT_SSEL_VLO            (2)  /* WDT - Timer Clock Source Select: VLO_CLK */

#define WDT_BASE_PTR          ((WDT_MemMapPtr)__MSP430_BASEADDRESS_WDT_A__)
#endif

#ifdef __MSP430_HAS_SFR__
typedef struct SFR_MemMap
{
    union
    {
        uint16_t IE1;
        struct
        {
            uint16_t WDT        :1; /* WDT Interrupt Enable */
            uint16_t OF         :1; /* Osc Fault Enable */
            uint16_t Reserved   :1;
            uint16_t VMA        :1; /* Vacant Memory Interrupt Enable */
            uint16_t NMI        :1; /* NMI Interrupt Enable */
            uint16_t ACCV       :1; /* Flash Access Violation Interrupt Enable */
            uint16_t JMBIN      :1; /* JTAG Mail Box input Interrupt Enable */
            uint16_t JMBOUT     :1; /* JTAG Mail Box output Interrupt Enable */
        } IE;
    };
    union
    {
        uint16_t IFG1;
        struct
        {
            uint16_t WDT        :1; /* WDT Interrupt Flag */
            uint16_t OF         :1; /* Osc Fault Flag */
            uint16_t Reserved1  :1;
            uint16_t VMA        :1; /* Vacant Memory Interrupt Flag */
            uint16_t NMI        :1; /* NMI Interrupt Flag */
            uint16_t Reserved2  :1;
            uint16_t JMBIN      :1; /* JTAG Mail Box input Interrupt Flag */
            uint16_t JMBOUT     :1; /* JTAG Mail Box output Interrupt Flag */
        } IFG;
    };
    union
    {
        uint16_t RPCR;
        struct
        {
            uint16_t NMI        :1; /* NMI select */
            uint16_t NMIIES     :1; /* NMI edge select */
            uint16_t RSTUP      :1; /* RESET Pin pull down/up select */
            uint16_t RSTRE      :1; /* RESET Pin Resistor enable */
        } SYS;
    };
}volatile *SFR_MemMapPtr;

#define SFR_BASE_PTR          ((SFR_MemMapPtr)__MSP430_BASEADDRESS_SFR__)
#endif

#ifdef __MSP430_HAS_SYS__
typedef struct SYS_MemMap
{
    union
    {
        uint16_t CTL;
        struct
        {
            uint16_t RIVECT         :1; /* SYS - RAM based interrupt vectors */
            uint16_t                :1; /* SYS - Reserved */
            uint16_t PMMPE          :1; /* SYS - PMM access protect */
            uint16_t                :1; /* SYS - Reserved */
            uint16_t BSLIND         :1; /* SYS - TCK/RST indication detected */
            uint16_t JTAGPIN        :1; /* SYS - Dedicated JTAG pins enabled */
            uint16_t                :10; /* SYS - Reserved */
        };
    };
    union
    {
        uint16_t BSLC;
        struct
        {
            uint16_t SIZE   :2; /* SYS - BSL Protection Size 0 */
            uint16_t R      :1; /* SYS - RAM assigned to BSL */
            uint16_t        :11; /* SYS - Reserved */
            uint16_t OFF    :1; /* SYS - BSL Memeory disabled */
            uint16_t PE     :1; /* SYS - BSL Memory protection enabled */
        } BSL;
    };
    uint16_t RESERVED1;
    union
    {
        uint16_t JMBC;
        struct
        {
            uint16_t IN0FG      :1; /* SYS - Incoming JTAG Mailbox 0 Flag */
            uint16_t IN1FG      :1; /* SYS - Incoming JTAG Mailbox 1 Flag */
            uint16_t OUT0FG     :1; /* SYS - Outgoing JTAG Mailbox 0 Flag */
            uint16_t OUT1FG     :1; /* SYS - Outgoing JTAG Mailbox 1 Flag */
            uint16_t MODE       :1; /* SYS - JMB 16/32 Bit Mode */
            uint16_t            :1; /* SYS - Reserved */
            uint16_t CLR0OFF    :1; /* SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe */
            uint16_t CLR1OFF    :1; /* SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe */
            uint16_t            :8; /* SYS - Reserved */
        } JMB;
    };
    uint16_t JMBI[2];
    uint16_t JMBO[2];
    uint16_t RESERVED2[4];
    uint16_t ERRIV; /* Bus Error vector generator */
    uint16_t UNIV; /* User NMI vector generator */
    uint16_t SNIV; /* System NMI vector generator */
    uint16_t RSTIV; /* Reset vector generator */
}volatile *SYS_MemMapPtr;
#endif

#define SYS_BASE_PTR          ((SYS_MemMapPtr)__MSP430_BASEADDRESS_SYS__)

#endif

